####################
# Taps.
####################

tap 'heroku/brew'
tap 'blender/homebrew-tap'
tap 'danger/tap'
tap 'vapor/tap'

####################
# Brews.
####################

# Development.
brew 'heroku'
brew 'awscli'
brew 'carthage'
brew 'rome'
brew 'danger-js'
brew 'danger-swift'
brew 'jq'
brew 'python'
brew 'sqlite'
brew 'swiftlint'
brew 'zplug'
brew 'node'
brew 'vapor'
brew 'gpg'

# Code analysis.
brew 'cloc'

# Environment.
brew 'terminal-notifier'
brew 'htop'

####################
# Casks.
####################

# Utilities.
cask 'firefox'
cask 'private-internet-access'
cask 'rocket'
cask 'dropbox'

# "Pro" Tools.
cask 'alfred'
cask 'bartender'
cask 'istat-menus'
cask 'spectacle'

# Development.
cask 'android-studio'
cask 'tower'
cask 'iterm2'
cask 'qlcolorcode'
cask 'webpquicklook'
cask 'imageoptim'
cask 'atom'
cask 'postman'
cask 'charles'
cask 'docker'
cask 'paw'

# Design.
cask 'sketch'
cask 'zeplin'

# Chill.
cask 'spotify'
cask 'vlc'
cask 'steam'
cask 'plex-media-player'
cask 'discord'
cask 'deluge'
